app/controllers/resolutions_controller.rb

  def index
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)

  def show
    @ticket = Ticket.find(params[:ticket_id])
    @resolution = @ticket.resolutions.find(params[:id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
SELECT * FROM "resolutions" WHERE ("resolutions"."id" = 1 AND ("resolutions".ticket_id = 1))

  def new
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)

  def create
    @ticket = Ticket.find(params[:ticket_id])
    @resolution = @ticket.resolutions.build(params[:resolution])
    if @resolution.save
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
INSERT INTO "resolutions" ("created_at", "body", "updated_at", "timetores", "ticket_id", "resolvedby", "slevel", "phone", "email") VALUES('2010-04-10 17:35:48', 'sdsdsdsdsdsdsdsdsd', '2010-04-10 17:35:48', NULL, 3, 'fedff', 'Low', 232323, 'sdsd@dfdf.com')

  def edit
    @ticket = Ticket.find(params[:ticket_id])
    @resolution = @ticket.resolutions.find(params[:id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
SELECT * FROM "resolutions" WHERE ("resolutions"."id" = 1 AND ("resolutions".ticket_id = 1))

  def update
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)

  def destroy
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)