app/controllers/tickets_controller.rb

SELECT * FROM "tickets"
SELECT count(*) AS count_all FROM "resolutions"
---
  def index
    @tickets = Ticket.all
    @low= Resolution.lowlevel.count

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def show
    @ticket = Ticket.find(params[:id])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def edit
    @ticket = Ticket.find(params[:id])

INSERT INTO "tickets" ("name", "created_at", "title", "updated_at", "phone", "description", "email") VALUES('Bharat', '2010-04-05 18:59:02', 'hello', '2010-04-05 18:59:02', 23232323, 'problem ', 'bh@rat.com')
---
  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save

SELECT * FROM "tickets" WHERE ("tickets"."id" = 2)
DELETE FROM "tickets" WHERE "id" = 2
---
  def destroy
    @ticket = Ticket.find(params[:id])
    @ticket.destroy