app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "role", "username", "password_salt", "persistence_token", "email") VALUES('2010-04-06 15:11:04', '0961dd34a4731a082a0d0c044ea367b530e9e7cf9a90398cdc6a9638c0a03314f31991db46bedb63aed9a621b1c1b49d69c2f3b64102c405e4f76db89acbffa5', '2010-04-06 15:11:04', NULL, 'Admin', 'yZfWk-9vaVWPbL1VjDiw', '11c5edf20af04a6841ceec8605321b2bb6a8546cb4433a02abbfe313f6e913f78ae635bd2f02aa3e8f426d1fd702e62fc505858338dc8d2488608ee6832c54b3', 'admin@hdesk.com')
---
def create
  @user = User.new(params[:user])
  if @user.save